sa3mv3g/jerry/application/dependencies/lwip/port/stm32h5/ethernetif.c
/**
 ******************************************************************************
 * @file    ethernetif.c
 * @brief   STM32H5 LwIP Ethernet Interface with HAL callback model
 * @note    Clean implementation with proper buffer tracking to prevent RBU
 * errors. Each buffer can only be assigned to ONE descriptor at a time.
 ******************************************************************************
 */

/* Enable debug logging - set to 1 to enable, 0 to disable */
#include "ethernetif.h"

#include <stdio.h>
#include <string.h>

#include "FreeRTOS.h"
#include "bsp.h"
#include "ip_specs.h"
#include "lan8742.h"
#if CMAKE_ENABLE_MDNS
#include "lwip/apps/mdns.h"
#endif

#if CMAKE_ENABLE_SNTP
#include "lwip/apps/sntp.h"
#endif
#include "../../../../src/generated/jerry_device_registers.h"
#include "lwip/etharp.h"
#include "lwip/mem.h"
#include "lwip/memp.h"
#include "lwip/netif.h"
#include "lwip/opt.h"
#include "lwip/pbuf.h"
#include "lwip/stats.h"
#include "lwip/tcpip.h"
#include "lwip/timeouts.h"
#include "main.h"
#include "netif/ethernet.h"
#include "network_sync.h"
#include "semphr.h"
#include "stm32h5xx_hal.h"
#include "task.h"

/* ========================================================================== */
/*                 Private Definitions and Macros                             */
/* ========================================================================== */
#define ETH_DEBUG_ENABLE 0

#if ETH_DEBUG_ENABLE
#define ETH_DEBUG(fmt, ...) \
    LOG_INF("[ETH %lu] " fmt "\r\n", HAL_GetTick(), ##__VA_ARGS__)
#else
#define ETH_DEBUG(fmt, ...) ((void)0)
#endif
#define ETHIF_TX_TIMEOUT            (2000U)
#define INTERFACE_THREAD_STACK_SIZE (1024)
#define IFNAME0                     's'
#define IFNAME1                     't'
#define RX_BUFFER_COUNT             (ETH_RX_DESC_CNT * 2)
#define ETH_RX_BUFFER_SIZE          (1536U)

/* ========================================================================== */
/*                 Private Typedefs                                           */
/* ========================================================================== */
struct link_update_msg
{
    struct netif *netif;
    int32_t       phy_state;
};

/* ========================================================================== */
/*                 Private Function Prototype                                 */
/* ========================================================================== */
static void         ethernetif_input_task(void *argument);
static int32_t      ETH_PHY_IO_Init(void);
static int32_t      ETH_PHY_IO_DeInit(void);
static int32_t      ETH_PHY_IO_ReadReg(uint32_t DevAddr, uint32_t RegAddr,
                                       uint32_t *pRegVal);
static int32_t      ETH_PHY_IO_WriteReg(uint32_t DevAddr, uint32_t RegAddr,
                                        uint32_t RegVal);
static int32_t      ETH_PHY_IO_GetTick(void);
static int32_t      find_rx_buffer_index(uint8_t *buff);
static void         low_level_init(struct netif *netif);
static err_t        low_level_output(struct netif *netif, struct pbuf *p);
static struct pbuf *low_level_input(struct netif *netif);
static void         ethernetif_input_task(void *argument);
static inline int   is_phy_link_up(int32_t state);
static void         ethernetif_update_link_state(void *ctx);
static void         ethernetif_status_callback(struct netif *netif);

/* ========================================================================== */
/*                 Private Variable Declaration                               */
/* ========================================================================== */

/* MAC address is defined in ethernetif.h - single source of truth */
/* RX buffers in SRAM3 for cache coherency
 * IMPORTANT: We need MORE buffers than descriptors to handle the case where
 * some buffers are being processed by the application while DMA needs new ones.
 * Using 2x the descriptor count gives us headroom.
 */
static uint8_t RxBuff[RX_BUFFER_COUNT][ETH_RX_BUFFER_SIZE]
    __attribute__((section(".driver.eth_mac0_rx_buf"), aligned(32)));
/* Buffer tracking:
 * - RxBuffAssigned: Bitmask tracking which buffers are currently assigned to
 * DMA descriptors
 * - A buffer is "assigned" from when RxAllocateCallback returns it until
 * RxLinkCallback processes it
 * - After RxLinkCallback, the HAL clears BackupAddr0, and the next
 * RxAllocateCallback can reuse it
 */
/* Bitmask: bit N = buffer N assigned to DMA */
static volatile uint32_t RxBuffAssigned   = 0;
static volatile uint32_t CurrentRxBuffIdx = 0;
static SemaphoreHandle_t RxPktSemaphore   = NULL;
static SemaphoreHandle_t TxPktSemaphore   = NULL;
static TaskHandle_t      EthIfThread      = NULL;

/* Static semaphore buffers for FreeRTOS */
static StaticSemaphore_t RxSemaphoreBuffer;
static StaticSemaphore_t TxSemaphoreBuffer;

static lan8742_Object_t LAN8742;
static lan8742_IOCtx_t  LAN8742_IOCtx = {ETH_PHY_IO_Init, ETH_PHY_IO_DeInit,
                                         ETH_PHY_IO_WriteReg, ETH_PHY_IO_ReadReg,
                                         ETH_PHY_IO_GetTick};

/* Counter for RX interrupts - for debugging */
static volatile uint32_t RxIntCount = 0;

/* Debug counters for semaphore takes and packets processed */
static volatile uint32_t SemTakeCount      = 0;
static volatile uint32_t PktProcessedCount = 0;

/* DMA Descriptors in SRAM3 (non-cacheable) - defined in main.c */
extern ETH_DMADescTypeDef DMARxDscrTab[ETH_RX_DESC_CNT];
extern ETH_DMADescTypeDef DMATxDscrTab[ETH_TX_DESC_CNT];

/* Use the ETH handle from main.c */
extern ETH_HandleTypeDef heth;

/* ========================================================================== */
/*                 Public Functions                                           */
/* ========================================================================== */
/**
 * @brief  HAL ETH RX Allocate Callback - Allocates buffer for DMA descriptor
 * @param  buff: Pointer to receive buffer pointer
 * @note   This is the KEY function for preventing RBU errors!
 *         We track which buffers are assigned to DMA and only return free ones.
 *         A buffer is marked as "assigned" here and freed in RxLinkCallback.
 */
void HAL_ETH_RxAllocateCallback(uint8_t **buff)
{
    uint32_t startIdx = CurrentRxBuffIdx;

    /* Find a free buffer using round-robin search */
    for (uint32_t i = 0; i < RX_BUFFER_COUNT; i++)
    {
        uint32_t idx  = (startIdx + i) % RX_BUFFER_COUNT;
        uint32_t mask = (1U << idx);

        /* Check if buffer is free (not assigned to any descriptor) */
        if ((RxBuffAssigned & mask) == 0)
        {
            /* Mark buffer as assigned to DMA */
            RxBuffAssigned |= mask;
            CurrentRxBuffIdx = (idx + 1) % RX_BUFFER_COUNT;
            *buff            = &RxBuff[idx][0];
            return;
        }
    }

    /* No buffer available - this will cause RBU error! */
    ETH_DEBUG("RxAlloc FAILED! No free buffers", 0);
    *buff = NULL;
}

/**
 * @brief  HAL ETH RX Link Callback - Links received data to pbuf chain
 * @param  pStart: Pointer to start of pbuf chain
 * @param  pEnd: Pointer to end of pbuf chain
 * @param  buff: Pointer to received data buffer
 * @param  Length: Length of received data
 * @note   We copy data from DMA buffer to a new pbuf, then FREE the buffer
 *         so it can be reused by RxAllocateCallback.
 */
void HAL_ETH_RxLinkCallback(void **pStart, void **pEnd, uint8_t *buff,
                            uint16_t Length)
{
    struct pbuf **ppStart = (struct pbuf **)pStart;
    struct pbuf **ppEnd   = (struct pbuf **)pEnd;
    struct pbuf  *p;
    int32_t       bufIdx;

    /* Find buffer index and mark it as free */
    bufIdx = find_rx_buffer_index(buff);
    if (bufIdx >= 0)
    {
        /* Clear the assigned bit - buffer is now free for reuse */
        RxBuffAssigned &= ~(1U << bufIdx);
    }

