sa3mv3g/jerry/application/dependencies/lwip/port/stm32h5/ethernetif.c
    /* Allocate a pbuf for the received frame segment */
    p = pbuf_alloc(PBUF_RAW, Length, PBUF_POOL);

    if (p != NULL)
    {
        /* Data Synchronization Barrier before reading DMA buffer */
        __DSB();
        pbuf_take(p, buff, Length);

        /* Chain the pbuf */
        if (*ppStart == NULL)
        {
            *ppStart = p;
        }
        else if (*ppEnd != NULL)
        {
            pbuf_cat(*ppEnd, p);
        }
        *ppEnd = p;
    }
    else
    {
        ETH_DEBUG("pbuf_alloc FAILED!", 0);
    }
}

void ethernetif_input(struct netif *netif)
{
    struct pbuf *p;
    p = low_level_input(netif);
    if (p != NULL)
    {
        err_t err = netif->input(p, netif);
        if (err != ERR_OK)
        {
            ETH_DEBUG("netif->input FAILED: err=%d", (int)err);
            pbuf_free(p);
        }
    }
}

err_t ethernetif_init(struct netif *netif)
{
    LWIP_ASSERT("netif != NULL", (netif != NULL));
#if LWIP_NETIF_HOSTNAME
    netif->hostname = "lwip";
#endif
    netif->name[0]    = IFNAME0;
    netif->name[1]    = IFNAME1;
    netif->output     = etharp_output;
    netif->linkoutput = low_level_output;
    netif_set_status_callback(netif, ethernetif_status_callback);
    low_level_init(netif);
    return ERR_OK;
}

void HAL_ETH_RxCpltCallback(ETH_HandleTypeDef *heth_param)
{
    (void)heth_param;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    RxIntCount++;
    if (RxPktSemaphore)
    {
        xSemaphoreGiveFromISR(RxPktSemaphore, &xHigherPriorityTaskWoken);
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
}

uint32_t ethernetif_get_sem_take_count(void) { return SemTakeCount; }

uint32_t ethernetif_get_pkt_processed_count(void) { return PktProcessedCount; }

uint32_t ethernetif_get_rx_int_count(void) { return RxIntCount; }

void HAL_ETH_TxCpltCallback(ETH_HandleTypeDef *heth_param)
{
    (void)heth_param;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;

    /* We MUST NOT call HAL_ETH_ReleaseTxPacket here because it calls
     * pbuf_free() via HAL_ETH_TxFreeCallback. FreeRTOS mutexes (used by LwIP
     * memory manager) cannot be taken in an ISR! We simply signal the
     * TxPktSemaphore. */
    if (TxPktSemaphore)
    {
        xSemaphoreGiveFromISR(TxPktSemaphore, &xHigherPriorityTaskWoken);
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
}

/**
 * @brief  HAL ETH TX Free Callback - Frees pbuf after transmission completes
 * @param  buff: Pointer to the packet data (actually a pbuf pointer cast to
 * uint32_t*)
 * @note   This callback is invoked by HAL_ETH_ReleaseTxPacket() for each
 *         transmitted packet. The buff parameter is the pData field from
 *         ETH_TxPacketConfigTypeDef, which we set to the pbuf pointer.
 *
 *         Without this callback, transmitted pbufs are never freed, causing
 *         heap exhaustion during sustained traffic.
 */
void HAL_ETH_TxFreeCallback(uint32_t *buff)
{
    /* The buff parameter is actually the pbuf pointer we stored in
     * TxConfig.pData */
    struct pbuf *p = (struct pbuf *)buff;

    if (p != NULL)
    {
        /* Free the pbuf - this decrements the reference count.
         * The pbuf was ref'd in low_level_output() before transmission. */
        pbuf_free(p);
    }
}

void HAL_ETH_ErrorCallback(ETH_HandleTypeDef *heth_param)
{
    uint32_t error = HAL_ETH_GetDMAError(heth_param);

    if (error & ETH_DMACSR_RBU)
    {
        ETH_DEBUG("RBU Error - restarting RX DMA", 0);
    }

    if (error & ETH_DMACSR_TBU)
    {
        ETH_DEBUG("TBU Error - restarting TX DMA", 0);
    }
}

void ethernetif_check_link(struct netif *netif)
{
    int32_t PHYLinkState = LAN8742_GetLinkState(&LAN8742);

    uint8_t is_up  = netif_is_link_up(netif) ? 1 : 0;
    uint8_t phy_up = is_phy_link_up(PHYLinkState) ? 1 : 0;

    if (is_up != phy_up)
    {
        /* Post to tcpip_thread to avoid data races on LwIP structures and ETH
         * HAL */
        struct link_update_msg *msg = (struct link_update_msg *)mem_malloc(
            sizeof(struct link_update_msg));
        if (msg != NULL)
        {
            msg->netif     = netif;
            msg->phy_state = PHYLinkState;
            if (tcpip_callback(ethernetif_update_link_state, msg) != ERR_OK)
            {
                mem_free(msg);
            }
        }
    }
}

void ethernetif_poll(struct netif *netif) { ethernetif_input(netif); }

void ethernet_link_thread(void *argument)
{
    struct netif *netif = (struct netif *)argument;

    for (;;)
    {
        ethernetif_check_link(netif);
        vTaskDelay(pdMS_TO_TICKS(100));
    }
}

/* ========================================================================== */
/*                 Private Functions                                          */
/* ========================================================================== */

static void ethernetif_status_callback(struct netif *netif)
{
    static bool services_initialized = false;

    /* Guard: only handle our netif, once, when IP is valid */
    if (netif_is_up(netif) && !ip4_addr_isany(netif_ip4_addr(netif)) &&
        !services_initialized)
    {
        ip_addr_t   sntp_server_ip;
        static char hostname[32];
        char        ip_str[16];
        char        gw_str[16];
        char        nm_str[16];
        uint8_t     dev_addr;

        /* --- System state update --- */
        dev_addr = BSP_GetDeviceAddress();
        snprintf(hostname, sizeof(hostname), "jerry-dev-%u",
                 (unsigned int)dev_addr);

        NetworkSync_SignalDhcpReady();

        /* --- Log network configuration --- */
        ip4addr_ntoa_r(netif_ip4_addr(netif), ip_str, sizeof(ip_str));
        ip4addr_ntoa_r(netif_ip4_gw(netif), gw_str, sizeof(gw_str));
        ip4addr_ntoa_r(netif_ip4_netmask(netif), nm_str, sizeof(nm_str));

#if CMAKE_ENABLE_DHCP
        printf("=== DHCP Complete ===\r\n");
#else
        printf("=== Static IP Ready ===\r\n");
#endif
        printf("IP Address : %s\r\n", ip_str);
        printf("Netmask    : %s\r\n", nm_str);
        printf("Gateway    : %s\r\n", gw_str);
        printf("Flags      : 0x%02x\r\n", netif->flags);
        printf("netif_default: %p, our netif: %p\r\n", (void *)netif_default,
               (void *)netif);
        printf("=====================\r\n");

#if CMAKE_ENABLE_SNTP
        /* --- Initialize SNTP --- */
        printf("Initializing SNTP...\r\n");

        jerry_device_holding_registers_t *hrRegs =
            jerry_device_get_holding_registers();
        uint32_t sntp_ip = hrRegs->sntp_server_ip;

        IP_ADDR4(&sntp_server_ip, (sntp_ip >> 24) & 0xFF,
                 (sntp_ip >> 16) & 0xFF, (sntp_ip >> 8) & 0xFF, sntp_ip & 0xFF);

        sntp_setserver(0, &sntp_server_ip);
        sntp_setoperatingmode(SNTP_OPMODE_POLL);
        sntp_init();
#endif

#if CMAKE_ENABLE_MDNS
        mdns_resp_init();

        err_t err = mdns_resp_add_netif(netif, hostname, 255);
        if (err != ERR_OK)
        {
            printf("mDNS: add_netif failed: %d\r\n", (int)err);
            return;
        }
        printf("mDNS: netif registered: '%s'\r\n", hostname);

        int8_t slot = mdns_resp_add_service(
            netif, hostname, "_modbus", DNSSD_PROTO_TCP, 502, 120, NULL, NULL);
        if (slot >= 0)
        {
            printf("mDNS: service registered (slot: %d)\r\n", slot);
            // mdns_resp_announce(netif);
        }
        else
        {
            printf("mDNS: add_service failed: %d\r\n", (int)slot);
        }
#endif

