sa3mv3g/jerry/application/dependencies/lwip/port/stm32h5/ethernetif.c
    HAL_ETH_ReleaseTxPacket(&heth);
    heth.ErrorCode = HAL_ETH_ERROR_NONE;
    tx_status      = HAL_ETH_Transmit_IT(&heth, &localTxConfig);

    uint32_t retries = 0U;
    while (tx_status != HAL_OK)
    {
        if ((HAL_ETH_GetError(&heth) & HAL_ETH_ERROR_BUSY) && (retries < 3U))
        {
            retries++;
            if (xSemaphoreTake(TxPktSemaphore,
                               pdMS_TO_TICKS(ETHIF_TX_TIMEOUT)) != pdTRUE)
            {
                ETH_DEBUG("TX semaphore timeout (retry %lu)", retries);
            }
            HAL_ETH_ReleaseTxPacket(&heth);
            heth.ErrorCode = HAL_ETH_ERROR_NONE;
            tx_status      = HAL_ETH_Transmit_IT(&heth, &localTxConfig);
        }
        else
        {
            ETH_DEBUG("TX FAILED after %lu retries!", retries);
            pbuf_free(p);
            return ERR_IF;
        }
    }

    /* Note: pbuf freed later via HAL_ETH_TxFreeCallback → pbuf_free(p) */
    return ERR_OK;
}

static struct pbuf *low_level_input(struct netif *netif)
{
    (void)netif;
    struct pbuf *p = NULL;

    if (HAL_ETH_ReadData(&heth, (void **)&p) == HAL_OK && p != NULL)
    {
        __DSB();
        /* Update link statistics */
        LINK_STATS_INC(link.recv);

        /* Log packet details including first bytes for protocol identification
         */
        uint8_t *data = (uint8_t *)p->payload;
        (void)data;
        ETH_DEBUG(
            "RX: len=%u, dst=%02X:%02X:%02X:%02X:%02X:%02X, type=0x%02X%02X",
            (unsigned)p->tot_len, data[0], data[1], data[2], data[3], data[4],
            data[5], data[12], data[13]);
    }
    return p;
}

static void ethernetif_input_task(void *argument)
{
    struct pbuf  *p;
    struct netif *netif = (struct netif *)argument;

    for (;;)
    {
        if (xSemaphoreTake(RxPktSemaphore, pdMS_TO_TICKS(5000)) == pdTRUE)
        {
            SemTakeCount++;
            do
            {
                p = low_level_input(netif);
                if (p != NULL)
                {
                    PktProcessedCount++;
                    if (netif->input(p, netif) != ERR_OK)
                    {
                        ETH_DEBUG("netif->input FAILED!", 0);
                        pbuf_free(p);
                    }
                }
            } while (p != NULL);
        }
    }
}

/**
 * @brief  Check if PHY link state indicates link is truly UP
 */
static inline int is_phy_link_up(int32_t state)
{
    return (state >= LAN8742_STATUS_100MBITS_FULLDUPLEX &&
            state <= LAN8742_STATUS_10MBITS_HALFDUPLEX);
}

static void ethernetif_update_link_state(void *ctx)
{
    struct link_update_msg *msg          = (struct link_update_msg *)ctx;
    struct netif           *netif        = msg->netif;
    int32_t                 PHYLinkState = msg->phy_state;

    /* Link was up, now it's down */
    if (netif_is_link_up(netif) && !is_phy_link_up(PHYLinkState))
    {
        ETH_DEBUG("Link DOWN", 0);
        HAL_ETH_Stop_IT(&heth);
        netif_set_down(netif);
        netif_set_link_down(netif);
    }
    /* Link was down, now it's up */
    else if (!netif_is_link_up(netif) && is_phy_link_up(PHYLinkState))
    {
        ETH_MACConfigTypeDef MACConf = {0};
        uint32_t duplex = ETH_FULLDUPLEX_MODE, speed = ETH_SPEED_100M;

        ETH_DEBUG("Link UP", 0);

        switch (PHYLinkState)
        {
            case LAN8742_STATUS_100MBITS_FULLDUPLEX:
                duplex = ETH_FULLDUPLEX_MODE;
                speed  = ETH_SPEED_100M;
                break;
            case LAN8742_STATUS_100MBITS_HALFDUPLEX:
                duplex = ETH_HALFDUPLEX_MODE;
                speed  = ETH_SPEED_100M;
                break;
            case LAN8742_STATUS_10MBITS_FULLDUPLEX:
                duplex = ETH_FULLDUPLEX_MODE;
                speed  = ETH_SPEED_10M;
                break;
            case LAN8742_STATUS_10MBITS_HALFDUPLEX:
                duplex = ETH_HALFDUPLEX_MODE;
                speed  = ETH_SPEED_10M;
                break;
            default:
                break;
        }
        HAL_ETH_GetMACConfig(&heth, &MACConf);
        MACConf.DuplexMode = duplex;
        MACConf.Speed      = speed;
        HAL_ETH_SetMACConfig(&heth, &MACConf);

        ETH_MACFilterConfigTypeDef MACFilterConf = {0};
        HAL_ETH_GetMACFilterConfig(&heth, &MACFilterConf);
        MACFilterConf.PassAllMulticast =
            ENABLE;  // Let multicast packets through!
        HAL_ETH_SetMACFilterConfig(&heth, &MACFilterConf);

        /* Reset buffer tracking before starting ETH */
        RxBuffAssigned   = 0;
        CurrentRxBuffIdx = 0;

        /* Memory barriers before starting DMA */
        __DSB();
        __ISB();

        /* Start ETH - let HAL handle descriptor initialization */
        if (HAL_ETH_Start_IT(&heth) == HAL_OK)
        {
            netif_set_up(netif);
            netif_set_link_up(netif);
            ETH_DEBUG("ETH started", 0);
        }
        else
        {
            ETH_DEBUG("HAL_ETH_Start_IT FAILED!", 0);
        }
    }

    /* Free the allocated message */
    mem_free(msg);
}

/* ========================================================================== */
/*                 Private Callback Handlers                                  */
/* ========================================================================== */

/* ========================================================================== */
/*                 Test/Debug/Other Sections                                  */
/* ========================================================================== */